{
    "_commit_hash": null,
    "add_projection": true,
    "architectures": [
      "DPTForDepthEstimation"
    ],
    "attention_probs_dropout_prob": null,
    "auxiliary_loss_weight": 0.4,
    "backbone_featmap_shape": null,
    "backbone_out_indices": null,
    "fusion_hidden_size": 256,
    "head_in_index": -1,
    "hidden_act": "gelu",
    "hidden_dropout_prob": null,
    "hidden_size": 768,
    "image_size": null,
    "initializer_range": 0.02,
    "intermediate_size": null,
    "is_hybrid": false,
    "layer_norm_eps": null,
    "model_type": "dpt",
    "neck_hidden_sizes": [
      320,
      640,
      1280,
      1280
    ],
    "neck_ignore_stages": [],
    "num_attention_heads": null,
    "num_channels": null,
    "num_hidden_layers": null,
    "patch_size": null,
    "qkv_bias": null,
    "readout_type": "project",
    "reassemble_factors": [
      4,
      2,
      1,
      0.5
    ],
    "semantic_classifier_dropout": 0.1,
    "semantic_loss_ignore_index": 255,
    "torch_dtype": "float32",
    "transformers_version": null,
    "use_auxiliary_head": true,
    "use_batch_norm_in_fusion_residual": false,
    "use_bias_in_fusion_residual": false
  }
